Revit 2024 API
AdvancedMetal Class
 A static class that provides access to the property names that appear in the AdvancedMetal visual asset schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static class AdvancedMetal
Visual Basic
Public NotInheritable Class AdvancedMetal
Visual C++
public ref class AdvancedMetal abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AdvancedMetal
See Also
AdvancedMetal Members
Autodesk.Revit.DB.Visual Namespace